---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RoomFailures.RoomHeightNegative
source: html/fda07eca-edab-6dfb-9621-70410454de07.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RoomFailures.RoomHeightNegative Property

[Room] must have a height greater than 0.

## Syntax (C#)
```csharp
public static FailureDefinitionId RoomHeightNegative { get; }
```